src/Documents/ЗаданиеТорговомуПредставителю/ЗаданиеТорговомуПредставителю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеТорговомуПредставителю</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <type>
      <types>CatalogRef.ГрафикиОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйПредставитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВизитаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВизитаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияПоНоменклатуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаданийТорговымПредставителям</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОбслуживания</name>
    <type>
      <types>CatalogRef.УсловияОбслуживанияПартнеровТорговымиПредставителями</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРезультата</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <attributes>
      <name>ВариантОплаты</name>
      <type>
        <types>EnumRef.ВариантыОплатыКлиентом</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗалогаЗаТару</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗалогаЗаТару</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДолгиПоЗаказам</name>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>НашДолг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолгКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОплатеПросрочено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОтгрузкеПросрочено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаДебиторскойЗадолженности</name>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетныйДокумент</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаРегистров</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.СписаниеЗадолженности</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УменьшениеДолга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УвеличениеДолга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ДниНедели/ДниНедели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДниНедели</name>
  <enumValues>
    <name>Понедельник</name>
  </enumValues>
  <enumValues>
    <name>Вторник</name>
  </enumValues>
  <enumValues>
    <name>Среда</name>
  </enumValues>
  <enumValues>
    <name>Четверг</name>
  </enumValues>
  <enumValues>
    <name>Пятница</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаданиеТорговомуПредставителю/Forms/ПодготовкаЗаданий/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОтборыСписковКлиентСервер.СкопироватьСписокВыбораОтбораПоМенеджеру(Элементы.Куратор.СписокВыбора, ПолучитьСписокВыбораОтбораПоКураторуСервер());
	
	УстановитьПараметрыСпискаЗаданий();

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Куратор = Настройки.Получить("Куратор");
	ТорговыйПредставитель = Настройки.Получить("ТорговыйПредставитель");
	ПериодПодготовкиЗаданий = Настройки.Получить("ПериодПодготовкиЗаданий");
	УстановитьПараметрыСпискаЗаданий();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаданий, "ТорговыйПредставитель", ТорговыйПредставитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ТорговыйПредставитель));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаданий, "Куратор", Куратор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Куратор));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗаданиеТорговомуПредставителю" Тогда
		Элементы.СписокЗаданий.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПодготовкиЗаданийПриИзменении(Элемент)
	
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("ДатаНачалаРаботы",ПериодПодготовкиЗаданий.ДатаНачала);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("НачальнаяДатаПланирования", Макс(НачалоДня(ТекущаяДата()), ПериодПодготовкиЗаданий.ДатаНачала));
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("КонечнаяДатаПланирования", ПериодПодготовкиЗаданий.ДатаОкончания);
	
	Элементы.СписокЗаданий.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ТорговыйПредставительПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаданий, "ТорговыйПредставитель", ТорговыйПредставитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ТорговыйПредставитель));

КонецПроцедуры

&НаКлиенте
Процедура КураторПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗаданий, "Куратор", Куратор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Куратор));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура СписокЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент = Элементы.СписокЗаданийЗаданиеТорговомуПредставителю Тогда
		
		ПараметрыФормы = Новый Структура();
		
		Если Элементы.СписокЗаданий.ТекущиеДанные.ЗаданиеТорговомуПредставителю.Пустая() Тогда
			ЗначенияЗаполнения = Новый Структура();
			ЗначенияЗаполнения.Вставить("Партнер", Элементы.СписокЗаданий.ТекущиеДанные.Партнер);
			ЗначенияЗаполнения.Вставить("УсловияОбслуживания", Элементы.СписокЗаданий.ТекущиеДанные.УсловияОбслуживания);
			
			ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
		Иначе	
			ПараметрыФормы.Вставить("Ключ",Элементы.СписокЗаданий.ТекущиеДанные.ЗаданиеТорговомуПредставителю);
		КонецЕсли;
		
		ОткрытьФормуЗаданияТорговомуПредставителю(ПараметрыФормы);
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.СписокЗаданийПартнер Тогда
		
		ПараметрыФормы = Новый Структура();
		Если ЗначениеЗаполнено(Элементы.СписокЗаданий.ТекущиеДанные.Партнер) Тогда
			ПараметрыФормы.Вставить("Ключ",Элементы.СписокЗаданий.ТекущиеДанные.Партнер);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.Партнеры.ФормаОбъекта", ПараметрыФормы, Элементы.СписокЗаданийПартнер);
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.СписокЗаданийСоглашение Тогда
		
		ПараметрыФормы = Новый Структура();
		Если ЗначениеЗаполнено(Элементы.СписокЗаданий.ТекущиеДанные.Соглашение) Тогда
			ПараметрыФормы.Вставить("Ключ",Элементы.СписокЗаданий.ТекущиеДанные.Соглашение);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.СоглашенияСКлиентами.ФормаОбъекта", ПараметрыФормы, Элементы.СписокЗаданийСоглашение);
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.СписокЗаданийУсловияОбслуживания Тогда
		
		ПараметрыФормы = Новый Структура();
		Если ЗначениеЗаполнено(Элементы.СписокЗаданий.ТекущиеДанные.УсловияОбслуживания) Тогда
			ПараметрыФормы.Вставить("Ключ",Элементы.СписокЗаданий.ТекущиеДанные.УсловияОбслуживания);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.ФормаОбъекта", ПараметрыФормы, Элементы.СписокЗаданийУсловияОбслуживания);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗадание(Команда)

	ПараметрыФормы = Новый Структура();
	ОткрытьФормуЗаданияТорговомуПредставителю(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаПечатиБланковЗадания(Команда)

	ОткрытьФорму("Документ.ЗаданиеТорговомуПредставителю.Форма.НастройкаПечатиБланковЗадания");

КонецПроцедуры

&НаКлиенте
Процедура ПечатьБланкаЗадания(Команда)
	
	МассивОбъектов = ПолучитьМассивЗаданийДляПечати();
	
	Если МассивОбъектов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны задания для печати';uk='Не вибрані завдання для друку'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура();
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ЗаданиеТорговомуПредставителю",
													"БланкЗадания,БланкЗаказа",
													МассивОбъектов,
													Неопределено,
													ПараметрыПечати);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьСводногоЗадания(Команда)
	
	МассивОбъектов = ПолучитьМассивЗаданийДляПечати();
	
	Если МассивОбъектов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны задания для печати';uk='Не вибрані завдання для друку'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура();
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ЗаданиеТорговомуПредставителю",
													"СводноеЗадание",
													МассивОбъектов,
													Неопределено,
													ПараметрыПечати);

												КонецПроцедуры
												
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокЗаданийЗаданиеТорговомуПредставителю.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЗаданий.ЗаданиеТорговомуПредставителю");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Создать задание>';uk='<Створити завдання>'"));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаданияТорговомуПредставителю(ПараметрыФормы = Неопределено)

	ОткрытьФорму("Документ.ЗаданиеТорговомуПредставителю.ФормаОбъекта", ПараметрыФормы, Элементы.СписокЗаданий);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивЗаданийДляПечати()
	
	МассивОбъектов = Новый Массив();
	
	Для Каждого ИдентификаторСтроки из Элементы.СписокЗаданий.ВыделенныеСтроки Цикл
		Задание = Элементы.СписокЗаданий.ДанныеСтроки(ИдентификаторСтроки).ЗаданиеТорговомуПредставителю;
		Если ЗначениеЗаполнено(Задание) Тогда
			МассивОбъектов.Добавить(Задание);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивОбъектов;

КонецФункции

&НаСервере
Процедура УстановитьПараметрыСпискаЗаданий()
	
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("ДатаНачалаРаботы",ПериодПодготовкиЗаданий.ДатаНачала);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("НачальнаяДатаПланирования", Макс(НачалоДня(ТекущаяДата()), ПериодПодготовкиЗаданий.ДатаНачала));
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("КонечнаяДатаПланирования", ПериодПодготовкиЗаданий.ДатаОкончания);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("ПустаяДата",ПустаяДата);
	
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Понедельник",Перечисления.ДниНедели.Понедельник);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Вторник",Перечисления.ДниНедели.Вторник);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Среда",Перечисления.ДниНедели.Среда);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Четверг",Перечисления.ДниНедели.Четверг);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Пятница",Перечисления.ДниНедели.Пятница);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Суббота",Перечисления.ДниНедели.Суббота);
	СписокЗаданий.Параметры.УстановитьЗначениеПараметра("Воскресенье",Перечисления.ДниНедели.Воскресенье);

КонецПроцедуры

 &НаСервереБезКонтекста
Функция ПолучитьСписокВыбораОтбораПоКураторуСервер()
	
	Возврат ОбщегоНазначенияУТ.ПолучитьСписокПользователейСПравомДобавления(Метаданные.Документы.ЗаданиеТорговомуПредставителю);
	
КонецФункции
	
#КонецОбласти
